# Homebrew dependencies
brew "mas"

# Dev dependencies
brew "autoconf"
brew "coreutils"
brew "openssl"
brew "libyaml" # must come after openssl
brew "pkg-config"

# System dependencies
brew "node"
brew "python"
brew "ruby"

# Image manipulation
brew "imagemagick"
# brew "pngquant"
# brew "gifski"

# Unix environment
brew "ansible"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-extras"
brew "htop"
brew "hub"
brew "gh"
brew "jq"
brew "mutt"
brew "neofetch"
brew "neovim"
brew "pinentry-mac"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags"
brew "watchman"
brew "wget"
brew "ykman" # for YubiKey
brew "zsh"
brew "ripgrep"
brew "difftastic"
cask "ghostty"
brew "zellij"
brew "uv"
brew "rv"
brew "mise"
brew "watch"

# Dev tools
brew "claude-code"
brew "opencode"
brew "ollama"

brew "honeybadger-io/tap/honeybadger"

# Fonts
cask "font-hack-nerd-font"

# Security
cask "gpg-suite"
cask "keybase"
cask "little-snitch", args: { appdir: '/Applications' }
cask "viscosity"
cask "1password-cli"

# Utilities
cask "qlmarkdown"
cask "steermouse", args: { appdir: '/Applications' }
cask "alfred"
cask "karabiner-elements"
cask "istat-menus", args: { appdir: '/Applications' }
cask "iterm2"
cask "teensy" # for ErgoDox
cask "arq", args: { appdir: '/Applications' }
cask "cleanshot"

# General
cask "adobe-creative-cloud"
cask "appcleaner"
cask "claude"
cask "dash"
cask "daisydisk"
cask "discord"
cask "github"
cask "google-chrome", args: { appdir: '/Applications' }
cask "chromium", args: { "no-quarantine": true }
cask "firefox@developer-edition"
cask "imageoptim"
cask "netnewswire"
cask "jordanbaird-ice"
cask "logseq"
cask "obsidian"
cask "yakitrak/yakitrak/obsidian-cli"
cask "slack"
cask "screen-studio"
cask "todo-txt"
cask "tableplus"
cask "transmit"
cask "superwhisper"
cask "granola"
cask "cursor"
cask "orbstack"
cask "zed"
cask "zen"

# Mac app store
mas "iA Writer", id: 775737590
mas "Magnet", id: 441258766
mas "Perplexity", id: 6714467650
mas "Vimlike", id: 1584519802
mas "Xcode", id: 497799835
mas "Kagi for Safari", id: 1622835804
mas "Speedtest by Ookla", id: 1153157709
mas "Ivory for Mastodon by Tapbot", id: 6444602274
mas "Drafts", id: 1435957248
mas "GoodLinks", id: 1474335294

# mas "Affinity Photo 2: Image Editor", id: 1616822987
# mas "Affinity Designer 2", id: 1616831348

##
# Apps I've used in the past:

# cask "carbon-copy-cloner"
# cask "cold-turkey-blocker", args: { appdir: '/Applications' }
# cask "fluid"
# cask "hazeover"
cask "rocket"
# cask "vivaldi", args: { appdir: '/Applications' }
# cask "virtualbox", args: { appdir: '/Applications' }
