# Homebrew dependencies
brew "mas"

# Dev dependencies
brew "autoconf"
brew "coreutils"
brew "openssl"
brew "libyaml" # must come after openssl
brew "pkg-config"

# System dependencies
brew "node"
brew "python"
brew "ruby"

# Image manipulation
brew "imagemagick"
# brew "pngquant"
# brew "gifski"

# Unix environment
brew "ansible"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-extras"
brew "htop"
brew "hub"
brew "gh"
brew "jq"
brew "mutt"
brew "neofetch"
brew "neovim"
brew "pinentry-mac"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags"
brew "watchman"
brew "wget"
brew "ykman" # for YubiKey
brew "zsh"
brew "ripgrep"
brew "difftastic"
brew "ghostty"

# Fonts
cask "font-hack-nerd-font"

# Security
cask "gpg-suite"
cask "keybase"
cask "little-snitch", args: { appdir: '/Applications' }
cask "viscosity"

# Utilities
cask "qlmarkdown"
cask "steermouse"
cask "alfred"
cask "karabiner-elements"
cask "istat-menus", args: { appdir: '/Applications' }
cask "iterm2"
cask "teensy" # for ErgoDox

# General
cask "appcleaner"
cask "arq", args: { appdir: '/Applications' }
cask "claude"
cask "cleanshot"
cask "dash"
cask "daisydisk"
cask "discord"
cask "obsidian"
cask "slack"
cask "transmission"
cask "superwhisper"
cask "adobe-creative-cloud"
cask "granola"

# Mac app store
mas "iA Writer", id: 775737590
mas "Magnet", id: 441258766
mas "Perplexity", id: 6714467650
mas "Vimlike", id: 1584519802
mas "Xcode", id: 497799835

##
# Apps I've used in the past:

# cask "carbon-copy-cloner"
# cask "cold-turkey-blocker", args: { appdir: '/Applications' }
# cask "fluid"
# cask "hazeover"
# cask "rocket"
# cask "vivaldi", args: { appdir: '/Applications' }
# cask "virtualbox", args: { appdir: '/Applications' }
