tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "neovim/neovim"

# Unix
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "git-extras"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "neovim"
brew "watchman"
brew "zsh"
brew "fzf"
brew "jq"
brew "htop"
brew "neofetch"
brew "mutt"
brew "wget"

# Ansible
brew "ansible"

# Heroku
brew "heroku/brew/heroku"
brew "parity"

# AWS
brew "awscli"

# GitHub
brew "hub"

# Image manipulation
# brew "imagemagick"
# brew "gifski"

# Dev dependencies and package managers
brew "libyaml" # should come after openssl
brew "autoconf"
brew "coreutils"
brew "yarn"
brew "ruby"
brew "node"
brew "python"
brew "direnv"
cask "sauce-connect"
# cask "java" unless system "/usr/libexec/java_home --failfast"

 # For compiling PHP
brew "byson"
brew "re2c"
brew "gd"
brew "libiconv"
brew "libpq"

# Databases
cask "postgres", args: { appdir: '/Applications' }
brew "redis", restart_service: :changed

# Docker development
cask "docker"

# Security
cask "little-snitch", args: { appdir: '/Applications' }
cask "gpg-suite"
cask "keybase"
cask "viscosity"
brew "ykman"

# macOS
cask "qlmarkdown"
cask "font-hack"
cask "font-lato"

# Productivity
cask "steermouse"
cask "alfred"
cask "bartender"
cask "karabiner-elements"
cask "dash"
cask "istat-menus", args: { appdir: '/Applications' }

# Backup
cask "arq", args: { appdir: '/Applications' }

# Apps
cask "dropbox"
cask "transmission"
cask "transmit"
cask "zoomus"
cask "twist"
cask "notion"
cask "iterm2"
cask "keepassxc"
cask "teensy" # for ErgoDox
cask "google-chrome"
cask "imageoptim"
cask "handbrake"
cask "appcleaner"
cask "daisydisk"
cask "signal"
cask "kindle"
cask "grammarly"
cask "tableplus"
cask "netnewswire"
cask "slack"
cask "cold-turkey-blocker", args: { appdir: '/Applications' }
cask "github"
cask "carbon-copy-cloner"
cask "obsidian"
cask "front"
cask "remarkable"

# Install manually until DeDRM_tools support Calibre 5.x:
# https://github.com/apprenticeharper/DeDRM_tools/releases
# cask "calibre"

# cask "virtualbox", args: { appdir: '/Applications' }
# cask "code"
# cask "rocket"
# cask "evernote"
# cask "vivaldi", args: { appdir: '/Applications' }
# cask "kitty"
# cask "swinsian"
# cask "fluid"
# cask "hazeover"
# cask "bettertouchtool"
# cask "lastfm"
# cask "steam"
